Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Подмодель: если был активирован узел, получающий данные из узла Выполение узла, ссылающегося на Подмодель, то при попытке переместить исходную Подмодель внутрь другой Подмодели возникала ошибка (#7901).
en: Supernode: if the node receiving data from the Node execution node referring to the Supernode was activated, an error occurred while attempting to move the source Supernode into another Supernode (#7901).

source: Производный компонент: если удалялся Производный компонент (№1), Производный узел (№1) которого являлся Базовым для другого Производного компонента (№2), то при попытке создать Производный узел (№2) возникала неинформативная ошибка (#7993).
en: Derived component: if Derived Component (№1) was deleted, Derived Node (№1) of which was the Base one for other Derived Component (№2), while attempting to create Derived Node (№2), uninformative error occurred (#7993).

source: Соединение: при соединение таблицы и переменных некорректно обрабатывалась настройка «Количество строк соответствует» со значением Определяется набором: на выход всегда передавалась одна строка (#7945).
en: Join: when joining a table and variables, "Row count complies" setting was incorrectly processed with the following value: Data set defined. One row was always transferred to the output (#7945).

source: Сортировка: на странице Сортировка мастера настройки теперь поля пропадают из списка Доступные поля при добавлении их в список Поля сортировки; ранее поля оставались в списке доступных, что могло приводить к ошибкам, если ранее добавленное в список сортируемых поле переносилось в список повторно при помощи Drag&Drop (#7831).
en: Sort: now the fields disappear from the Available fields list on Sort wizard page when adding them to Sort fields list. Previously, the fields were in the list of the available ones that could cause errors if the field earlier added to the list of the sorted fields was repeatedly moved to the list using Drag&Drop (#7831).

source: Статистика: для строковых полей в визуализаторе Статистика были перепутаны текстовые подсказки для столбцов Минимум и Максимум (отображались, соответственно «Наибольшая длина строки:» и «Наименьшая длина строки:») (#7647).
en: Statistics: text tips were confused for Minimum and Maximum columns ("Maximum string length:" and "Minimum string length:" were displayed, correspondingly) for string fields in the Statistics visualizer (#7647).

source: Таблица: доступные в детализации Таблицы пункты меню «Переместить вверх» и «Переместить вниз» работали некорректно (#5760).
en: Table: "Move up" and "Move down" menu items available in the Table detailing functioned incorrectly (#5760).

source: Фильтр строк: если запросить список уникальных значений у предварительно настроенного фильтра с типом условия «В списке», то в редких случаях возникала ошибка "Cannot read property 'getRange' of null" (#4461, #5598, #6436).
en: Row filter: the following error seldom occurred if the unique values list was requested for the preset filter with "Listed" condition type: "Cannot read property 'getRange' of null" (#4461, #5598, #6436).

source: Формирование XML: если элемент XSD-схемы содержал несколько элементов с maxOccurs > 1, то при повторном запуске узла возникала ошибка (#7932).
en: XML Generation: if the XSD schema item contained several items with maxOccurs > 1, an error occurred after the repeated start of the node (#7932).

source: Экспорт в Базу данных Firebird: не экспортировались строковые данные в локальную базу данных Firebird если экспортированный набор данных имел более одной строки (#7839).
en: Export to Firebird Database: the string data was not exported to the local Firebird database if the exported data set contained more than one string (#7839).

source: В этой версии исправлено несколько ошибок, возникавших при работе с веб-сервисами и базами данных, исправлена проблема с использованием JSDoc-комментариев в мастере настройки JavaScript, а также внесены исправления в другие компоненты.
en: Several issues detected while operation of web-services and databases were fixed in this version, the problem connected with the usage of the JSDoc comments in the JavaScript wizard was solved, other components were also corrected.

source: Веб-приложение: при добавлении связи с одновременным созданием нового порта (через порт «+», который есть у компонентов Соединение, Дополнение данных и других) в редких случаях могла возникнуть ошибка «Не удалось создать новый порт Значение ObjectId не закешировано» (#8039).
en: Web application: when adding link and creating a new port at the same time (using "+" port of Join, Enrich Data components, etc), the following error could sometimes occur: "Failed to create new port ObjectId value is not cached" (#8039).

source: Импорт из Excel: не загружались данные из xlsx-файлов, если в метаданных файла отсутствовала информация о диапазоне данных, при этом в окне предварительного просмотра мастера настройки данные отображались; файлы с неполными метаданными могут формироваться при экспорте из сторонних приложений, например, 1C или Google Docs (#6684, #7745).
en: Import from Excel: the data from the xlsx files was not loaded if there was no information on the data range in the metadata, and the data was not displayed in the wizard preview window. The files with incomplete metadata can be generated when exporting from the third-party applications, for example, 1C or Google Docs (#6684, #7745).

source: Квантование: если сразу после изменения настроек метода (например, количества интервалов) изменялась настройка разрядности отображаемых в таблице чисел, то ранее заданные настройки метода сбрасывались (#7848).
en: Binning: if upon the method settings change (for example, bin count), the bitness configuration displayed in the numerical table was changed, the earlier defined method settings were reset (#7848).

source: Конечные классы: если в таблицах полей и конечных классов отменялась сортировка при помощи трехкратного нажатия на заголовок, то возникала ошибка (#7889).
en: Coarse сlasses: an error occurred if sorting by means of three-time pressing on the header was cancelled in the fields tables and coarse classes (#7889).

source: Настройка соответствия между переменными: если одна из выделенных записей удалялась при помощи иконки корзины, то при последующей попытке удалить все вделенные записи при помощи вызова пункта контекстного меню или нажатием на Delete, то возникала ошибка «Расширение для базового идентификатора {...-..-..-..-...} не найдено» (#7843).
en: Adjustment of Variables Mapping: if one of the selected records was removed using the recycle bin icon, the following error occurred while attempting to delete all selected records calling the context menu item or pressing Delete: "No extension for {...-..-..-..-...} base identifier found" (#7843).

source: Настройка соответствия между столбцами: при множественном удалении используемых выходных полей приложение долго обрабатывало запрос, а затем запрашивало подтверждение удаления для каждого поля в отдельности (#7921).
en: Adjustment of Columns Mapping: in the case of multiple deleting of used output fields, the application processed the request for a long period of time and separately requested a confirmation of deletion of each field (#7921).

source: Подмодель: при попытке переместить несколько узлов сложно связанных узлов могла возникнуть ошибка «Сценарий содержит 1 заблокированных узлов»; например, такая ошибка могла возникнуть при перемещении узлов, связанных через Узел-ссылку, находящийся внутри Подмодели (#7977).
en: Supernode: while attempting to move several nodes of complexly connected nodes, the following error could occur: "Workflow contains 1 locked node". For example, such error could occur when moving the nodes connected by means of the Reference Node that is inside the Supernode (#7977).

source: Развернуть/Свернуть подмодель: если внутри Подмодели был создан производный компонент, а затем внутри Подмодели были удалены все узлы, то при разворачивании такой Подмодели удалялся ранее созданный Производный компонент; теперь при разворачивании подмодели Производный компонент выносится из подмодели на уровень вверх (#7923).
en: Expand/Collapse Supernode: if the derived component was created inside the Supernode, and then all nodes were deleted inside the Supernode, when expanding such Supernode, the earlier created Derived Component was deleted. Now, when expanding the Supernode, the Derived Component is moved one level up from the Supernode (#7923).

source: Статистика: при сортировке в таблице уникальных значений по полю Кол-во большого количества записей (несколько тысяч и более), значения сортировались как строки, а при отмене сортировки таблица уникальных значений оставалась пустой (#7829, #7830).
en: Statistics: when sorting large number of records (several thousands and more) in the table of the unique values by the Count field, the values were sorted as strings, and when cancelling sorting, the table of the unique values stayed empty (#7829, #7830).

source: Статистика: сортировка уникальных значений в панели гистограммы визуализатора Статистика не совпадала с порядком в других визуализаторах (#7679).
en: Statistics: sorting of the unique values on the histogram panel of the Statistics visualizer didn't match the order in other visualizers (#7679).

source: Фильтр строк: если был выбран тип данных Дата/Время и один из типов условия (не) первый / (не) последний, то не сохранялась настройка «Тип временного промежутка» День, а также после сохранения и повторного открытия пакета сбрасывалось значение параметра «Базовая дата интервала» (#7893).
en: Row filter: if the Date/Time data type and one of (not) first / (not) last condition types were selected, "Time span unit" Day setting was not saved, and just after saving and repeated opening of the package, the value of the "Base interval date" parameter was reset (#7893).

source: AddColumn — добавление столбца в конец списка столбцов выходного набора;
en: AddColumn — addition of a column to the list end of the output data set columns.

source: ArcSin(0)=1,57 вместо 0, ArcCos(0)=0 вместо 1,57.
en: ArcSin(0)=1,57 instead of 0, ArcCos(0)=0 instead of 1,57.

source: AssignColumns — создание столбцов выходного набора из коллекции имен/описаний столбцов;
en: AssignColumns — creation of the output data set columns from the collection of columns names/descriptions.

source: ClearColumns — очистка списка столбцов.
en: ClearColumns — clearing a list of columns.

source: DeleteColumn — удаление столбца по имени или индексу;
en: DeleteColumn — deletion of a column by name or index.

source: EM Кластеризация
en: EM Clustering

source: Execution of request terminated with error: 5023".
en: Execution of request was terminated with error: 5023".

source: InsertColumn — вставка столбца по заданному индексу в выходной набор;
en: InsertColumn — insertion of a column into the output data set by the set index.

source: Integrator каждый час отправляет запросы Loginom Server для отслеживания изменений опубликованных пакетов, чтобы исключить ситуацию, при которой через какое-то время после запуска Loginom Integrator может перестать реагировать на изменение опубликованных пакетов (#9314).
en: Every hour Integrator sends requests to Loginom Server to track changes of published packages to exclude the situation when Loginom Integrator could stop react to change of published packages after a while after start of Loginom Integrator (#9314).

source: Kafka Apache — популярная распределенная система обмена сообщениями между серверными приложениями в режиме реального времени.
en: Kafka Apache is a popular distributed system of message exchange between server applications in real time.

source: Loginom 6.3.5 — описание изменений
en: Loginom 6.3.5 — Release Notes

source: Loginom 6.4.3 — описание изменений
en: Loginom 6.4.3 — Release Notes

source: Loginom 6.5.5 — описание изменений Исправлены ошибки в мастере настройки импорта из Excel-файла и экспорта в базу данных.
en: Loginom 6.5.5 — Release Notes. Errors in Import from Excel file and Export to Database wizard were corrected.

source: Loginom Integrator для версии Team работает на том же сервере, что и Loginom Server.
en: Loginom Integrator for the Team version is used on the same server as Loginom Server.

source: Loginom Server мог зависнуть (#9316).
en: Loginom Server could be frozen (#9316).

source: Loginom стал кроссплатформенным — серверные редакции Standard и Enterprise доступны для операционных систем Linux и Windows.
en: Loginom became cross-platform. Standard and Enterprise editions are available for Linux and Windows operating systems.

source: REST-запрос
en: REST request

source: SCRAM-SHA-256 Authentication и SCRAM-SHA-256-PLUS Authentication для PostgreSQL;
en: SCRAM-SHA-256 Authentication and SCRAM-SHA-256-PLUS Authentication for PostgreSQL;

source: SHA-256 authentication для MySQL 8 при подключении без использования клиента;
en: SHA-256 authentication for MySQL 8 when connecting without client use;

source: А запрос к аналогичному сервису через postman отрабатывал корректно и возвращал ответ.
en: And request to the similar service via postman worked correctly and returned the response.

source: А при активации клона такого узла возникала ошибка Access violation.
en: Access violation error occurred when activating such node clone.

source: А при использовании драйвера Microsoft Access Text Driver в мастере настройки был пустой список столбцов (#9193, #10225).
en: When using Microsoft Access Text Driver, there was an empty list of columns in the wizard (#9193, #10225).

source: А также добавлены функции setTimeout и clearTimeout, реализована поддержка кодирования/декодирования данных в формате Base64.
en: setTimeout and clearTimeout functions were also added. Data encoding/decoding support in Base64 format was implemented.

source: Автоматическая синхронизация полей в Loginom
en: Automapping of fields in Loginom

source: Автоматическое сохранение резервных копий пакетов
en: Auto Save of the Packages Backup Copies

source: Автоматическое сохранение резервных копий пакетов в серверных редакциях.
en: Auto save of the packages backup copies in the server editions.

source: Администрирование
en: Administration

source: Активация возможности выполнения Python
en: Activation of the Python execution feature

source: Активация любых других узлов сценария, кроме узлов-ссылок, завершалась аналогичной ошибкой.
en: Activation of all other workflow nodes with the exception of reference nodes was finished with the same error.

source: Алгоритм определения формата и разделителей дат стал более «строгим» с учетом наличия в строке даты и времени.
en: The date format and separator definition algorithm became "stricter". Date and time specification in the row is taken into account.

source: Алгоритм подключения Loginom Integrator к Loginom Server:
en: Algorithm of Loginom Integrator connection to Loginom Server is described below:

source: Аналогичное ограничение снято для Фильтра строк. Ранее это могло доставлять неудобство, если производилась настройка фильтров по большому количеству записей, например, SKU.
en: The similar restriction was removed for Row filter. Previously, it was rather inconvenient to set filters by many records, for example, SKU.

source: Атрибут maxEntrySize задаёт максимальный размер сообщения в байтах.
en: maxEntrySize attribute sets the maximum message size in bytes.

source: Атрибут включает/отключает генерацию страницы openapi/index.html, которая реализует доступ к опубликованным сервисам через Swagger UI.
en: The attribute enables/disables generation of openapi/index.html page that implements access to the published services via Swagger UI.

source: База данных остается в памяти до тех пор, пока активно подключение к ней.
en: Database is kept in memory until its connection is active.

source: Базовый пакет, открытый в одной сессии, в других всегда должен открываться только на чтение.
en: The base package opened in one session must be always read-only opened in all other sessions.

source: Базу данных SQLite теперь можно использовать in-memory.
en: SQLite database can be used in-memory now.

source: Благодаря высокой пропускной способности, масштабируемости и отказоустойчивости применяется в крупных проектах с большими объемами данных.
en: Due to its high capacity, scalability and failure safety it is applied in large-scale projects with large volumes of data.

source: Блоки заметок
en: Notes blocks

source: Блоки заметок имеют предустановленный набор цветовых стилей.
en: Pre-installed set of color styles is provided for notes blocks.

source: Более подробная информация о работе компонента доступна в соответствующем разделе справки, а также всегда можно задать вопрос в Loginom Q&A или обратиться в службу технической поддержки.
en: More detailed information on the component operation is available in the corresponding Help section, and it is always possible to ask a question in Loginom Q&A or contact the Technical Support Service.

source: Большое количество исправлений внесено в компоненты, связанные с работой баз данных и веб-сервисов.
en: Many corrections were made in the components connected with databases and web services operation.

source: Было обнаружено, что драйвер ODBC для PostgreSQL не может вернуть количество столбцов для подготовленного, но невыполненного запроса.
en: It was detected that ODBC driver for PostgreSQL could not return the number of columns for the prepared but not executed request.

source: Быстрый просмор данных в Loginom
en: Quick View in Loginom

source: Быстрый просмотр
en: Quick View

source: Быстрый просмотр при выделении активизированного узла
en: Quick view when selecting the activated node

source: Быстрый просмотр результатов вычислений при выделении узла.
en: Quick view of the calculation results when selecting the node.

source: В Инспекторе свойств убрали иконки для узлов дерева.
en: Tree nodes icons were removed in the Property Inspector.

source: В Калькуляторе в режиме JavaScript доступны функций преобразования base64-закодированных строк в строки двоичных данных и обратно.
en: Functions of base64 encoded rows transformation to binary data rows and vice versa are available in Calculator in the JavaScript mode.

source: В Редактировании выбросов метод обработки «Заменять заданным значением» стал доступен для всех типов данных.
en: "Replace with set value" processing method became available for all data types in Eliminate outliers.

source: В визуализаторе Куб появилась возможность настраивать измерения в отдельном окне.
en: It became possible to configure dimensions in a separate window in Cube visualizer.

source: В линейной регрессии исправлен расчет показателей модели, в частности: Логарифм функции правдоподобия, Стандартное отклонение, F-статистика, P-значение модели, Коэффициент детерминации.
en: Calculation of the model parameters was corrected in the linear regression as follows: Log-likelihood, Standard deviation, F-statistic, Model P-value, Coefficient of determination.

source: В Квантовании по-другому работает метод разбиения «Плитка» с типом обработки совпадающих наблюдений «Назначить случайно».
en: "Tile" partitioning method with "Set randomly" type of matching observations processing works differently in Binning.

source: В JavaScript появилась поддержка Fetch API, особенно важного для работы с REST и JSON-запросами и для обращения к внешним веб-сервисам.
en: Fetch API support was introduced into JavaScript. It is especially important for the REST and JSON requests operation and access to the external web services.

source: В Loginom 6.4 внесено два существенных изменения, позволяющих расширить возможности использования Логистической регрессии, а в ряде случаев повысить качество получаемых моделей.
en: Two important changes that enable to expand possibilities of the Logistic Regression use and in some cases to increase the quality of the received models were introduced into Loginom 6.4.

source: В Loginom 6.4 появилась возможность встраивать в сценарий расчеты, сделанные при помощи кода на языке программирования Python.
en: In Loginom 6.4 it became possible to embed the calculations made using the Python programming language code into the workflow.

source: В Loginom 6.5 существенно были улучшены следующие компоненты обработки:
en: The following processing components were significantly improved in Loginom 6.5:

source: В Loginom 7 изменился механизм сравнения и конвертации строк.
en: The mechanism of row comparison and conversion was changed in Loginom 7.

source: В Loginom Enterprise появилась возможность импортировать и экспортировать сообщения в очередь Kafka.
en: Import and export of messages to Kafka queue became possible in Loginom Enterprise.

source: В Loginom Integrator для версии Team поддерживаются публикация только в формате REST-сервисов.
en: Publications in Loginom Integrator for the Team version are supported only in the REST services format.

source: В Loginom Integrator дополнена логируемая информация.
en: The logged information was complemented in Loginom Integrator.

source: В Loginom Integrator изменен формат сообщений об ошибке.
en: Error message format was changed in Loginom Integrator.

source: В Loginom Integrator появилась поддержка OpenAPI и Swagger UI.
en: Now OpenAPI and Swagger UI are supported in Loginom Integrator.

source: В Loginom Server Team добавлено создание unix socket, если в файле конфигурации отсутствует элемент Bindings.
en: Now it is possible to create unix socket in Loginom Server Team if there is no Bindings element in the configuration file.

source: В Loginom не содержится инструментов разработки, аналогичных PyCharm и другим специализированным продуктам.
en: There are no development tools in Loginom that are similar to PyCharm and other specialized products.

source: В Python при отправке таблицы pandas в output_table для меток столбцов не производится транслитерация в функции prepare_compatible_table.
en: When sending pandas tables in output_table for column captions in Python, transliteration in prepare_compatible_table function is not performed.

source: В Windows он выбирался из хранилища личных сертификатов.
en: In Windows it was selected from the storage of personal certificates.

source: В XSD-схему запроса и ответа разрешено вносить изменения, совместимые с ранее настроенными списками выбранных элементов.
en: It is allowed to introduce changes compatible with preconfigured lists of selected elements into the XSD schema of request and response.

source: В Интеграторе кэшировался OpenAPI документ с тем протоколом, который был использован при первом обращении к этому OpenAPI документу, а затем этот закэшированный документ возвращался и при обращении по http, и по https.
en: OpenAPI document was cached in Integrator with the same protocol that was used on the first access to this OpenAPI document, and then this cached document returned on access both via http and https.

source: В Калькуляторе в функции Stat появился еще один показатель для вычислений — мода.
en: One more calculation parameter was introduced into the Calculator in Stat function — mode.

source: В большинстве случаев это позволяет более точно определить типы данных, используемые в импортируемом наборе.
en: Generally, it enables to specify the data types used in the imported set more precisely.

source: В версии под Linux не поддерживается аутентификация при помощи предоставления сертификата клиента.
en: Authentification via client certificate is not supported in the Linux version.

source: В визуализаторе Статистика явно обозначены ячейки с нерассчитанными показателями и кнопки запуска расчетов.
en: The cells with uncalculated parameters and calculation start buttons are explicitly specified in Statistics visualizer.
